Repository: hatamisg/Rutin-App
Catalog: rutin/*.lproj/Localizable.strings
Languages: kk

# alert_delete_habit
source: Delete Habit
kk: Дәстүрді жою

# alert_delete_habit_message
source: Are you sure you want to delete «%@»?
kk: «%@» дәстүрін шынымен жойғыңыз келе ме?

# alert_reset_history
source: Reset History
kk: Тарихты қалпына келтіру

# alert_reset_history_message
source: This will permanently delete all habit completion data. This action cannot be undone.
kk: Бұл барлық дәстүр аяқталу деректерін біржола жояды. Бұл әрекетті кері қайтару мүмкін емес.

# alert_notifications_permission
source: Notification Permission Required
kk: Хабарламаларға рұқсат қажет

# alert_notifications_permission_message
source: To receive habit reminders, please enable notifications in Settings.
kk: Дәстүр ескертпелерін алу үшін, Параметрлерде хабарламаларды қосыңыз.

# button_add
source: Add
kk: Қосу

# button_done
source: Done
kk: Дайын

# button_delete
source: Delete
kk: Жою

# button_cancel
source: Cancel
kk: Болдырмау

# button_edit
source: Edit
kk: Өңдеу

# button_save
source: Save
kk: Сақтау

# button_reset
source: Reset
kk: Қалпына келтіру

# button_reset_progress
source: Reset progress
kk: Жетістікті қалпына келтіру

source: Complete
kk: Аяқтау

source: Completed
kk: Аяқталды

source: Today
kk: Бүгін

source: Yesterday
kk: Кеше

source: Count
kk: Саны

source: Time
kk: Уақыт

source: Goal: %@
kk: Мақсат: %@

source: Streak
kk: Үздіксіз жетістік

source: Best
kk: Ең жақсы

source: Total
kk: Жалпы

source: Week
kk: Апта

source: Month
kk: Ай

source: Year
kk: Жыл

# widget_no_active_habits_today
source: No active habits for today
kk: Бүгін белсенді дәстүрлер жоқ

# widget_title
source: Habits
kk: Дәстүрлер

# widget_description
source: Track your habits progress
kk: Дәстүрлеріңіздің жетістіктерін бақылаңыз

source: Home
kk: Басты бет

source: Statistics
kk: Статистика

source: Settings
kk: Параметрлер

source: Habit Name
kk: Дәстүр атауы

# icon_and_color
source: Icon & Color
kk: Белгіше және түс

# goalsection_choose_time
source: Choose time (hr:min)
kk: Уақытты таңдау (сағ:мин)

# goalsection_enter_count
source: Enter count
kk: Санын енгізу

source: Active days
kk: Белсенді күндер

source: Everyday
kk: Күнде

source: Every week
kk: Әр апта

source: Select days
kk: Күндерді таңдау

source: Reminders
kk: Ескертпелер

source: Reminder
kk: Ескертпе

source: Create Custom Habit
kk: Реттелетін дәстүр құру

source: Reading
kk: Оқу

source: Meditation
kk: Медитация

source: Drink Water
kk: Су ішу

source: Practice Yoga
kk: Йога жаттығулары

source: Running
kk: Жүгіру

source: Learn Language
kk: Тіл үйрену

source: Focus
kk: Зейін қою

source: Cold Shower
kk: Салқын душ

source: Workout
kk: Жаттығу

source: Swimming
kk: Жүзу

source: Cycling
kk: Велосипед тебу

source: Take Vitamins
kk: Витаминдер қабылдау

source: Eat Vegetables
kk: Көкөністер жеу

source: Practice Coding
kk: Кодтау жаттығулары

source: Plan My Day
kk: Күнімді жоспарлау

source: Journaling
kk: Күнделік жазу

source: Call Parents
kk: Ата-анамен байланысу

source: Play Piano
kk: Пианино ойнау

source: Wake Up Early
kk: Ерте ояну

source: Take a Walk
kk: Сергу

source: Add Count
kk: Санын қосу

source: Add progress
kk: Жетістік қосу

# add_reminder
source: Add
kk: Ескертпе қосу

source: Add Time
kk: Уақыт қосу

source: Create Habit
kk: Дәстүр құру

# daily_goal
source: Goal
kk: Күнделікті мақсат

source: Delete habit
kk: Дәстүрді жою

source: Edit Habit
kk: Дәстүрді өңдеу

source: Health
kk: Денсаулық

source: Hobbies
kk: Хобби

source: Lifestyle
kk: Өмір салты

source: Loading calendar…
kk: Күнтізбе жүктелуде…

source: Productivity
kk: Өнімділік

# reset_all_history
source: Reset history
kk: Барлық тарихты қалпына келтіру

source: Start date
kk: Басталу күні

source: Reorder
kk: Қайта реттеу

# notifications_habit_time
source: Time for your habit!
kk: Дәстүріңізді орындайтын уақыт келді!

# notifications_dont_forget
source: Don't forget to do: %@
kk: Ұмытпаңыз: %@

# goal_achieved_title
source: 🎉 Goal Achieved!
kk: 🎉 Мақсат орындалды!

# goal_achieved_body
source: You've completed %@
kk: Сіз %@ аяқтадыңыз!

source: Appearance
kk: Сыртқы түрі

source: Appearance mode
kk: Сыртқы түр режимі

# appearance_dark
source: Dark
kk: Қараңғы

# appearance_light
source: Light
kk: Ашық

# appearance_system
source: System
kk: Жүйе

source: App Color
kk: Қолданба түсі

source: App Icon
kk: Қолданба белгішесі

# week_start_day
source: Week Start
kk: Аптаның басы

# week_start_system
source: System
kk: Жүйе

source: Language
kk: Тіл

source: iCloud Sync
kk: iCloud синхрондау

# icloud_sync_status
source: Sync Status
kk: Синхрондау күйі

# icloud_sync_active
source: Active
kk: Белсенді

# icloud_checking_status
source: Checking...
kk: Тексерілуде…

# icloud_not_signed_in
source: Sign in to iCloud
kk: iCloud-қа кіру

# icloud_restricted
source: iCloud is Restricted
kk: iCloud шектелген

# icloud_how_sync_works
source: How Sync Works
kk: Синхрондау қалай жұмыс істейді

# icloud_automatic_backup
source: Automatic Backup
kk: Автоматты сақтық көшірме

# icloud_automatic_backup_desc
source: All habits are automatically saved to your iCloud
kk: Барлық дәстүрлер сіздің iCloud-та автоматты түрде сақталады

# icloud_cross_device_sync
source: Cross-Device Sync
kk: Құрылғылар арасындағы синхрондау

# icloud_cross_device_sync_desc
source: Access your habits on iPhone, iPad, and other devices
kk: iPhone, iPad және басқа құрылғыларда дәстүрлеріңізге қол жеткізіңіз

# icloud_private_secure
source: Privacy & Security
kk: Құпиялылық және қауіпсіздік

# icloud_private_secure_desc
source: Data is stored only in your personal iCloud
kk: Деректер тек сіздің жеке iCloud-та сақталады

# icloud_troubleshooting
source: Troubleshooting
kk: Ақауларды жою

# icloud_signin_required
source: iCloud sign-in is required for syncing
kk: Синхрондау үшін iCloud-қа кіру қажет

# icloud_signin_steps
source: Settings → [Your Name] → iCloud → Sign In
kk: Параметрлер → [Сіздің атыңыз] → iCloud → Кіру

# icloud_status_unknown
source: Status Unknown
kk: Күйі белгісіз

# icloud_temporarily_unavailable
source: Temporarily Unavailable
kk: Уақытша қолжетімсіз

# icloud_unknown_error
source: Unknown Error
kk: Белгісіз қате

# icloud_check_failed
source: Check Failed
kk: Тексеру сәтсіз аяқталды

# icloud_force_sync
source: Force Sync
kk: Мәжбүрлі синхрондау

# icloud_force_sync_desc
source: Manually trigger iCloud synchronization
kk: iCloud синхрондауын қолмен бастау

# icloud_last_sync
source: Last Sync
kk: Соңғы синхрондау

# icloud_manual_sync
source: Manual Sync
kk: Қолмен синхрондау

# icloud_manual_sync_footer
source: Use manual sync if data doesn't appear on other devices automatically
kk: Егер деректер басқа құрылғыларда автоматты түрде көрінбесе, қолмен синхрондауды пайдаланыңыз

# icloud_today_at
source: Today at %@
kk: Бүгін %@ уақытында

# icloud_yesterday_at
source: Yesterday at %@
kk: Кеше %@ уақытында

# icloud_database_error
source: iCloud database access error
kk: iCloud деректер базасына кіру қатесі

source: Archive
kk: Мұрағаттау

source: Archived Habits
kk: Мұрағатталған дәстүрлер

source: Unarchive
kk: Мұрағаттан шығару

# archived_habits_footer
source: Swipe left to unarchive or delete
kk: Мұрағаттан шығару немесе жою үшін солға сырғытыңыз

source: Export Data
kk: Деректерді экспорттау

# export_button
source: Export
kk: Экспорт

# export_error_title
source: Export Failed
kk: Экспорттау сәтсіз аяқталды

# privacy_auth_reason
source: Unlock rutin to access your data
kk: Деректерге қол жеткізу үшін rutin құлпын ашыңыз

source: Passcode & Face ID
kk: Құпия сөз және Face ID

source: Enter Passcode
kk: Құпия сөзді енгізу

source: Create Passcode
kk: Құпия сөз құру

source: Enter Current Passcode
kk: Ағымдағы құпия сөзді енгізу

source: Confirm Passcode
kk: Құпия сөзді растау

source: Enter New Passcode
kk: Жаңа құпия сөзді енгізу

source: Request Passcode
kk: Құпия сөз талап етіледі

source: Disable Passcode
kk: Құпия сөзді өшіру

source: Change Passcode
kk: Құпия сөзді өзгерту

source: Turn Passcode On
kk: Құпия сөзді қосу

# immediately
source: Immediate
kk: Дереу

source: 1 minute
kk: 1 минут

source: 5 minutes
kk: 5 минут

source: 15 minutes
kk: 15 минут

source: 30 minutes
kk: 30 минут

source: 1 hour
kk: 1 сағат

source: Not Now
kk: Қазір емес

source: Enable
kk: Қосу

# biometric_unlock_description
source: Use %@ to unlock the app quickly and securely without entering your passcode.
kk: %@ пайдаланып, құпия сөз енгізбестен қолданбаны тез және қауіпсіз ашу.

source: On
kk: Қосулы

source: Off
kk: Өшірулі

source: Notifications
kk: Хабарламалар

source: Haptics
kk: Тактильді кері байланыс

source: Sounds
kk: Дыбыстар

source: Completion Sounds
kk: Аяқтау дыбыстары

# default_sound
source: Default
kk: Әдепкі

source: Rate App
kk: Қолданбаны бағалау

source: Share App
kk: Қолданбаны бөлісу

source: Contact Developer
kk: Әзірлеушімен байланысу

source: Terms of Service
kk: Қызмет көрсету шарттары

source: Privacy Policy
kk: Құпиялылық саясаты

source: Licenses
kk: Лицензиялар

# licenses_section_attributions
source: Attributions
kk: Атрибуциялар

# paywall_unlock_premium
source: Unlock premium features
kk: Премиум мүмкіндіктерді ашу

# paywall_purchase_result_title
source: Purchase Result
kk: Сатып алу нәтижесі

# paywall_ok_button
source: OK
kk: Жарайды

# paywall_processing_button
source: Processing...
kk: Өңделуде…

# paywall_restore_purchases_button
source: Restore Purchases
kk: Сатып алуларды қалпына келтіру

# paywall_family_sharing_button
source: Supports Family Sharing
kk: Отбасылық бөлісуді қолдайды

# paywall_legal_text
source: Payment will be charged to your Apple ID account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.
kk: Сатып алуды растаған кезде сіздің Apple ID есептік жазбаңыздан төлем алынады. Автоматты жаңарту ағымдағы кезең аяқталғанға дейін кем дегенде 24 сағат бұрын өшірілмесе, автоматты түрде жаңарады.

# paywall_purchase_failed_message
source: Purchase failed. Please try again.
kk: Сатып алу сәтсіз аяқталды. Қайтадан көріңіз.

# paywall_restore_success_message
source: Purchases restored successfully!
kk: Сатып алулар сәтті қалпына келтірілді!

# paywall_no_purchases_to_restore_message
source: No purchases to restore.
kk: Қалпына келтіруге болатын сатып алулар жоқ.

# paywall_unlimited_habits_title
source: Unlimited Habits
kk: Шексіз әдеттер

# paywall_unlimited_habits_description
source: Create as many habits as you want.
kk: Қалағаныңызша әдеттер жасаңыз.

# paywall_detailed_statistics_title
source: Detailed Statistics
kk: Толық статистика

# paywall_detailed_statistics_description
source: Track your progress with a calendar and charts.
kk: Күнтізбе және диаграммалар арқылы прогресті бақылаңыз.

# paywall_multiple_reminders_title
source: Multiple Reminders
kk: Бірнеше ескертпе

# paywall_multiple_reminders_description
source: Set as many daily reminders as you like.
kk: Күнделікті қалағанынша ескертпелер орнатыңыз.

# paywall_completion_sounds_title
source: Completion Sounds
kk: Аяқталу дыбыстары

# paywall_completion_sounds_description
source: Get satisfying sound effects when finishing habits.
kk: Әдетті аяқтағанда қанағаттанарлық дыбыстарды тыңдаңыз.

# paywall_premium_icons_title
source: 3D Habit Icons
kk: 3D әдеттік белгішелер

# paywall_premium_icons_description
source: Use stylish 3D icons to make your habits stand out.
kk: Стильді 3D белгішелерді пайдаланып әдеттеріңізді ерекшелендіріңіз.

# paywall_custom_colors_icons_title
source: Themes & App Icons
kk: Тақырыптар & App белгішелері

# paywall_custom_colors_icons_description
source: Personalize the app with custom themes and icons.
kk: Арнайы тақырыптар мен белгішелермен қолданбаны бейімдеңіз.

# paywall_export_title
source: Data Export
kk: Деректерді экспорттау

# paywall_export_description
source: Export your habit data as PDF or JSON files.
kk: Әдет деректерін PDF немесе JSON форматында экспорттаңыз.

# paywall_support_creator_title
source: Support the Creator
kk: Құраушыны қолдаңыз

# paywall_support_creator_description
source: This app is built by one person. Your support helps it grow.
kk: Бұл қолданба бір адам тарапынан жасалған. Сіздің қолдауыңыз оның дамуына көмектеседі.

# paywall_yearly_plan
source: Yearly
kk: Жылдық

# paywall_monthly_plan
source: Monthly
kk: Айлық

# paywall_7_days_free_trial
source: 7 days free
kk: 7 күн тегін

# paywall_lifetime_plan
source: Lifetime
kk: Өмірлік

# paywall_get_lifetime
source: Get Lifetime
kk: Өмірлік қолжетімділік алу

# paywall_subscribe
source: Subscribe
kk: Жазылу

# paywall_start_trial_monthly
source: Start 7 days free %@/month
kk: 7 күн тегін сынақ бастау %@/ай

# paywall_continue
source: Continue
kk: Жалғастыру

source: version
kk: Нұсқа

source: Made with
kk: Жасалған

source: in Kyrgyzstan
kk: Қырғызстанда

# empty_view_largetitle
source: Start Today, Grow Tomorrow
kk: Бүгін баста, ертең өс

# empty_view_title3
source: Step by Step
kk: Бір қадаммен

# empty_view_tap
source: Tap
kk: Түртіңіз

# empty_view_to_create_habit
source: to create your first habit
kk: Алғашқы дәстүріңізді құру үшін

source: Average
kk: Орташа

# tap_dates
source: Tap dates to edit progress
kk: Жетістікті өңдеу үшін күндерді түртіңіз

# press_hold_bars
source: Press and hold bars for details
kk: Толығырақ көру үшін бағандарды басып ұстаңыз

source: Active Habits
kk: Белсенді дәстүрлер

# completed_total
source: Completed
kk: Аяқталған

# active_days_total
source: Active Days
kk: Белсенді күндер

# overall_completion
source: Completion
kk: Жалпы аяқталу деңгейі

source: What it shows:
kk: Нені көрсетеді:

source: How it's calculated:
kk: Қалай есептеледі:

source: Example:
kk: Мысал:

# completed_total_description
source: Number of habit completions across all time. Each time you complete a daily goal for any habit, it counts toward this count.
kk: Уақыт өте келе аяқталған дәстүрлердің саны. Кез келген дәстүрдің күнделікті мақсатына жеткен сайын, ол осы жалпы сомаға қосылады.

# completed_total_calculation
source: We count every day when you met or exceeded your daily goal for any habit, from the beginning of your habit tracking journey.
kk: Біз сіздің дәстүрлерді бақылауды бастағаннан бері кез келген дәстүрдің күнделікті мақсатына жеткен немесе асып түскен әрбір күнді есептейміз.

# completed_total_example
source: If you completed 'Exercise' 30 times, 'Reading' 45 times, and 'Meditation' 60 times, your count would be 135 completions.
kk: Егер сіз 'Жаттығуды' 30 рет, 'Оқуды' 45 рет және 'Медитацияны' 60 рет аяқтасаңыз, сіздің жалпы сомаңыз 135 аяқталу болады.

# active_days_total_description
source: Number of days when you made progress on at least one habit throughout your entire tracking history.
kk: Барлық бақылау тарихыңызда кем дегенде бір дәстүрде жетістікке жеткен күндердің саны.

# active_days_total_calculation
source: We count unique days where you made any progress on any habit, from your very first tracked day until today.
kk: Біз сіздің алғашқы бақылау күніңізден бүгінге дейін кез келген дәстүрде жетістікке жеткен бірегей күндерді есептейміз.

# active_days_total_example
source: If you've been tracking for 100 days and made progress on 85 of those days, your active days count is 85.
kk: Егер сіз 100 күн бойы дәстүрлерді бақылап, олардың 85-інде жетістікке жетсеңіз, сіздің белсенді күндер саны 85 болады.

# overall_completion_description
source: Your average completion rate across all habits and all time. This shows your overall consistency and performance.
kk: Уақыт өте келе барлық дәстүрлеріңіздің орташа аяқталу деңгейі. Бұл сіздің жалпы тұрақтылығыңыз бен өнімділігіңізді көрсетеді.

# overall_completion_calculation
source: We calculate the completion percentage for each habit completion, then average all these percentages across your entire tracking history.
kk: Біз әрбір аяқталған дәстүрдің аяқталу пайызын есептейміз, содан кейін сіздің барлық бақылау тарихыңыз бойынша осы пайыздардың орташасын аламыз.

# overall_completion_example
source: If across all your habits and all time you average 78% completion, this shows you're consistently performing well.
kk: Егер сіздің барлық дәстүрлеріңіздің орташа аяқталу деңгейі 78% болса, бұл сіздің тұрақты түрде жақсы өнімділік көрсететіндігіңізді білдіреді.

# active_habits_description
source: Number of habits you're currently tracking (not including archived habits). This gives you an overview of your current habit workload.
kk: Қазіргі уақытта сіз бақылап отырған дәстүрлердің саны (мұрағатталған дәстүрлерді қоспағанда). Бұл сіздің ағымдағы дәстүр жүктемесінің жалпы шолуын береді.

# active_habits_calculation
source: We count all habits that are not archived. This includes habits that might not be active every day of the week, but are still part of your routine.
kk: Біз мұрағатталмаған барлық дәстүрлерді есептейміз, олар аптаның әр күні белсенді болмаса да, сіздің күнделікті өміріңіздің бір бөлігі болып табылады.

# active_habits_example
source: If you're tracking 'Morning Exercise', 'Read Books', and 'Drink Water', but archived 'Learn Spanish', your active habits count is 3.
kk: Егер сіз 'Таңертеңгі жаттығу', 'Кітап оқу' және 'Су ішу' дәстүрлерін бақылап, бірақ 'Испан тілін үйренуді' мұрағаттасаңыз, сіздің белсенді дәстүрлеріңіздің саны 3 болады.
